# HCP Terraform Plan Output

<!-- placeholder-1 -->
```fish
terraform plan -workspace=infrastructure
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
+ module.media_repository.github_actions_repository_permissions.default[0] will be created
+ module.media_repository.github_branch_protection.linear_history[0] will be created
+ module.media_repository.github_repository.default will be created
+ module.media_repository.github_repository_ruleset.no_deletion_or_force_push[0] will be created
+ module.media_repository.github_repository_ruleset.pull_request_conditions[0] will be created
+ module.media_repository.github_repository_ruleset.restrict_version_tags[0] will be created
```
</details>
<!-- placeholder-3 -->
<details open><summary>Plan: 6 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @AlexMan123456 at 2026-03-01T14:25:24Z [(view log)](https://github.com/alextheman231/infrastructure/actions/runs/22545364192/job/65306865082#step:4:1).
</summary>

```hcl
To view this run in a browser, visit:
https://app.terraform.io/app/alextheman/infrastructure/runs/run-uqdCENw8y6wauV9n

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.media_repository.github_actions_repository_permissions.default[0] will be created
  + resource "github_actions_repository_permissions" "default" {
      + allowed_actions      = "all"
      + enabled              = true
      + id                   = (known after apply)
      + repository           = "media"
      + sha_pinning_required = true
    }

  # module.media_repository.github_branch_protection.linear_history[0] will be created
  + resource "github_branch_protection" "linear_history" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "media"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true
    }

  # module.media_repository.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge                        = true
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = true
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = false
      + allow_update_branch                     = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + description                             = "Media used in my projects, often created with Manim"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_issues                              = true
      + has_projects                            = false
      + has_wiki                                = false
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "media"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = (known after apply)
      + visibility                              = "public"
      + vulnerability_alerts                    = (known after apply)
      + web_commit_signoff_required             = false

      + security_and_analysis (known after apply)
    }

  # module.media_repository.github_repository_ruleset.no_deletion_or_force_push[0] will be created
  + resource "github_repository_ruleset" "no_deletion_or_force_push" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Protect main from being deleted/force-pushed"
      + node_id     = (known after apply)
      + repository  = "media"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false
        }
    }

  # module.media_repository.github_repository_ruleset.pull_request_conditions[0] will be created
  + resource "github_repository_ruleset" "pull_request_conditions" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Pull request conditions (bypassable by admins)"
      + node_id     = (known after apply)
      + repository  = "media"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_type  = "OrganizationAdmin"
          + bypass_mode = "exempt"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = [
                  + "merge",
                  + "rebase",
                ]
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # module.media_repository.github_repository_ruleset.restrict_version_tags[0] will be created
  + resource "github_repository_ruleset" "restrict_version_tags" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Restriction against creating version tags (bypassable by alex-up-bot)"
      + node_id     = (known after apply)
      + repository  = "media"
      + ruleset_id  = (known after apply)
      + target      = "tag"

      + bypass_actors {
          + actor_id    = (sensitive value)
          + actor_type  = "Integration"
          + bypass_mode = "exempt"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/tags/*",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + tag_name_pattern {
              + name     = "Version numbers"
              + operator = "regex"
              + pattern  = "^(?:v)?(0|[1-9]\\d*)\\.(0|[1-9]\\d*)\\.(0|[1-9]\\d*)$"
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Run status: planned and saved (confirmable)
Workspace is unlocked
```
</details>
<!-- placeholder-5 -->
<!-- terraform-145-d5af4768b07130cf007cf09264eba2a3.tfplan -->
<!-- placeholder-6 -->